backend/load-test/scenarios/ready-toggle.yml
config:
  target: "{{ $env.TARGET_HOST }}"
  phases:
    - duration: 1
      arrivalCount: 1
      name: "Ready toggle"
  processor: "../processor.js"
  variables:
    host: "{{ $env.TARGET_HOST }}"
    menuId: 0
    menuCustomName: "토맛토마토"
    menuTemperature: "ICE"
    roomCount: 5
    guestCount: 7

scenarios:
  - name: "5방 × 8명 ready 토글"
    beforeScenario: "setup"
    flow:
      - think: 2
      - function: "sendReadyTrue"
      - think: 5